In [1]:
!pip install beautifulsoup4

Requirement already satisfied: beautifulsoup4 in c:\users\kvsr346\appdata\local\anaconda3\lib\site-packages (4.12.2)
Requirement already satisfied: soupsieve>1.2 in c:\users\kvsr346\appdata\local\anaconda3\lib\site-packages (from beautifulsoup4) (2.4)

#DATA PROCESSING

In [2]:
import pandas as pd

# Load the datasets
users = pd.read_csv('Users.csv')
books = pd.read_csv('Books.csv')
ratings = pd.read_csv('Ratings.csv')

C:\Users\kvsr346\AppData\Local\Temp\ipykernel_7300\789852993.py:5: DtypeWarning: Columns (3) have mixed types. Specify dtype option on import or set low_memory=False.
  books = pd.read_csv('Books.csv')

In [3]:
books.head()

,ISBN,Book-Title,Book-Author,Year-Of-Publication,Publisher,Image-URL-S,Image-URL-M,Image-URL-L
0,0195153448,Classical Mythology,Mark P. O. Morford,2002,Oxford University Press,http://images.amazon.com/images/P/0195153448.0...,http://images.amazon.com/images/P/0195153448.0...,http://images.amazon.com/images/P/0195153448.0...
1,0002005018,Clara Callan,Richard Bruce Wright,2001,HarperFlamingo Canada,http://images.amazon.com/images/P/0002005018.0...,http://images.amazon.com/images/P/0002005018.0...,http://images.amazon.com/images/P/0002005018.0...
2,0060973129,Decision in Normandy,Carlo D'Este,1991,HarperPerennial,http://images.amazon.com/images/P/0060973129.0...,http://images.amazon.com/images/P/0060973129.0...,http://images.amazon.com/images/P/0060973129.0...
3,0374157065,Flu: The Story of the Great Influenza Pandemic...,Gina Bari Kolata,1999,Farrar Straus Giroux,http://images.amazon.com/images/P/0374157065.0...,http://images.amazon.com/images/P/0374157065.0...,http://images.amazon.com/images/P/0374157065.0...
4,0393045218,The Mummies of Urumchi,E. J. W. Barber,1999,W. W. Norton &amp; Company,http://images.amazon.com/images/P/0393045218.0...,http://images.amazon.com/images/P/0393045218.0...,http://images.amazon.com/images/P/0393045218.0...

In [4]:
# Check for null values
null_values = books.isnull().sum()
print("Null values in each column:\n", null_values)

# Check for blank values (empty strings) in each column
blank_values = (books.applymap(lambda x: x == '')).sum()
print("Blank values in each column:\n", blank_values)

Null values in each column:
 ISBN                   0
Book-Title             0
Book-Author            1
Year-Of-Publication    0
Publisher              2
Image-URL-S            0
Image-URL-M            0
Image-URL-L            3
dtype: int64
Blank values in each column:
 ISBN                   0
Book-Title             0
Book-Author            0
Year-Of-Publication    0
Publisher              0
Image-URL-S            0
Image-URL-M            0
Image-URL-L            0
dtype: int64

In [5]:
users.head()

   User-ID                            Location   Age
0        1                  nyc, new york, usa   NaN
1        2           stockton, california, usa  18.0
2        3     moscow, yukon territory, russia   NaN
3        4           porto, v.n.gaia, portugal  17.0
4        5  farnborough, hants, united kingdom   NaN

In [6]:
# Check for null values
null_values = users.isnull().sum()
print("Null values in each column:\n", null_values)

# Check for blank values (empty strings) in each column
blank_values = (users.applymap(lambda x: x == '')).sum()
print("Blank values in each column:\n", blank_values)

Null values in each column:
 User-ID          0
Location         0
Age         110762
dtype: int64
Blank values in each column:
 User-ID     0
Location    0
Age         0
dtype: int64

In [7]:
#replace null age value with average age values
average_age = users['Age'].mean(skipna=True)
users['Age'].fillna(average_age, inplace=True)

In [8]:
#Verify Replacement:
null_values_after = users.isnull().sum()
print("Null values after replacement:\n", null_values_after)

Null values after replacement:
 User-ID     0
Location    0
Age         0
dtype: int64

In [9]:
ratings.head()

   User-ID        ISBN  Book-Rating
0   276725  034545104X            0
1   276726  0155061224            5
2   276727  0446520802            0
3   276729  052165615X            3
4   276729  0521795028            6

In [10]:
# Check for null values
null_values = ratings.isnull().sum()
print("Null values in each column:\n", null_values)

# Check for blank values (empty strings) in each column
blank_values = (ratings.applymap(lambda x: x == '')).sum()
print("Blank values in each column:\n", blank_values)

Null values in each column:
 User-ID        0
ISBN           0
Book-Rating    0
dtype: int64
Blank values in each column:
 User-ID        0
ISBN           0
Book-Rating    0
dtype: int64

In [11]:
books.describe()

,ISBN,Book-Title,Book-Author,Year-Of-Publication,Publisher,Image-URL-S,Image-URL-M,Image-URL-L
count,271360,271360,271359,271360,271358,271360,271360,271357
unique,271360,242135,102023,202,16807,271044,271044,271041
top,0195153448,Selected Poems,Agatha Christie,2002,Harlequin,http://images.amazon.com/images/P/185326119X.0...,http://images.amazon.com/images/P/185326119X.0...,http://images.amazon.com/images/P/225307649X.0...
freq,1,27,632,13903,7535,2,2,2

In [12]:
users.describe()

            User-ID            Age
count  278858.00000  278858.000000
mean   139429.50000      34.751434
std     80499.51502      11.202003
min         1.00000       0.000000
25%     69715.25000      29.000000
50%    139429.50000      34.751434
75%    209143.75000      35.000000
max    278858.00000     244.000000

In [13]:
count_userunique_id = users['User-ID'].nunique()
count_userunique_id

278858

In [14]:
ratings.describe()

            User-ID   Book-Rating
count  1.149780e+06  1.149780e+06
mean   1.403864e+05  2.866950e+00
std    8.056228e+04  3.854184e+00
min    2.000000e+00  0.000000e+00
25%    7.034500e+04  0.000000e+00
50%    1.410100e+05  0.000000e+00
75%    2.110280e+05  7.000000e+00
max    2.788540e+05  1.000000e+01

In [15]:
count_ratingsuserunique_id = ratings['User-ID'].nunique()
count_ratingsuserunique_id

105283

In [16]:
count_ratingsuser_id = ratings['User-ID'].count()
count_ratingsuser_id

1149780

#so we can see we have 11,49,780 reviews from unique 1,05,283 users. We have in total 2,78,858 users

In [17]:
# Count total number of ISBN entries in ratings
count_isbn_ratings = ratings['ISBN'].count()
print("Total number of ISBN entries in ratings:", count_isbn_ratings)

# Count unique number of ISBN entries in ratings
unique_count_isbn_ratings = ratings['ISBN'].nunique()
print("Unique number of ISBN entries in ratings:", unique_count_isbn_ratings)

# Count total number of ISBN entries in books
count_isbn_books = books['ISBN'].count()
print("Total number of ISBN entries in books:", count_isbn_books)

# Count unique number of ISBN entries in books
unique_count_isbn_books = books['ISBN'].nunique()
print("Unique number of ISBN entries in books:", unique_count_isbn_books)

Total number of ISBN entries in ratings: 1149780
Unique number of ISBN entries in ratings: 340556
Total number of ISBN entries in books: 271360
Unique number of ISBN entries in books: 271360

#similarly we have in total 2,71,360 books and while ratings provided for 3,40,556 unique books. so we can say there are ratings available for extra books as well.

In [24]:
#merge dataset ratings and books
# Merge the datasets on the 'ISBN' column
merged_df = pd.merge(ratings, books, on='ISBN', how='inner')

# Display the first few rows of the merged dataframe
merged_df.head()

,User-ID,ISBN,Book-Rating,Book-Title,Book-Author,Year-Of-Publication,Publisher,Image-URL-S,Image-URL-M,Image-URL-L
0,276725,034545104X,0,Flesh Tones: A Novel,M. J. Rose,2002,Ballantine Books,http://images.amazon.com/images/P/034545104X.0...,http://images.amazon.com/images/P/034545104X.0...,http://images.amazon.com/images/P/034545104X.0...
1,2313,034545104X,5,Flesh Tones: A Novel,M. J. Rose,2002,Ballantine Books,http://images.amazon.com/images/P/034545104X.0...,http://images.amazon.com/images/P/034545104X.0...,http://images.amazon.com/images/P/034545104X.0...
2,6543,034545104X,0,Flesh Tones: A Novel,M. J. Rose,2002,Ballantine Books,http://images.amazon.com/images/P/034545104X.0...,http://images.amazon.com/images/P/034545104X.0...,http://images.amazon.com/images/P/034545104X.0...
3,8680,034545104X,5,Flesh Tones: A Novel,M. J. Rose,2002,Ballantine Books,http://images.amazon.com/images/P/034545104X.0...,http://images.amazon.com/images/P/034545104X.0...,http://images.amazon.com/images/P/034545104X.0...
4,10314,034545104X,9,Flesh Tones: A Novel,M. J. Rose,2002,Ballantine Books,http://images.amazon.com/images/P/034545104X.0...,http://images.amazon.com/images/P/034545104X.0...,http://images.amazon.com/images/P/034545104X.0...

In [25]:
#Users dataset processing
users.head()

   User-ID                            Location        Age
0        1                  nyc, new york, usa  34.751434
1        2           stockton, california, usa  18.000000
2        3     moscow, yukon territory, russia  34.751434
3        4           porto, v.n.gaia, portugal  17.000000
4        5  farnborough, hants, united kingdom  34.751434

In [29]:
import pandas as pd
from sklearn.feature_extraction.text import TfidfVectorizer

# Sample data creation - replace this with your actual DataFrame creation process
data = {'metadata': ['This is a sample document.',
                     'This document is another sample document.',
                     'And this is a third sample document.']}
merged_df = pd.DataFrame(data)

# Print the DataFrame to inspect its structure
print("DataFrame content:")
print(merged_df)

# Print the column names to verify the presence of 'metadata'
print("DataFrame columns:")
print(merged_df.columns)

# Ensure the 'metadata' column exists
if 'metadata' not in merged_df.columns:
    raise KeyError("The 'metadata' column is not present in the DataFrame.")

# Initialize the TF-IDF Vectorizer
tfidf = TfidfVectorizer(stop_words='english')

# Fit and transform the 'metadata' column
tfidf_matrix = tfidf.fit_transform(merged_df['metadata'])

# Check the shape of the TF-IDF matrix
print(tfidf_matrix.shape)

DataFrame content:
                                    metadata
0                 This is a sample document.
1  This document is another sample document.
2       And this is a third sample document.
DataFrame columns:
Index(['metadata'], dtype='object')
(3, 2)

In [30]:
#Calculate Cosine Similarity'' compute cosine similarity between all books.
from sklearn.metrics.pairwise import linear_kernel

# Compute cosine similarity matrix
cosine_sim = linear_kernel(tfidf_matrix, tfidf_matrix)

In [36]:
#Create Recommendation Function
#Create a function that takes a book title and recommends similar books
# Construct a reverse map of indices and book titles
indices = pd.Series(merged_df.index, index=merged_df['Book-Title']).drop_duplicates()

def recommend_books(title, cosine_sim=cosine_sim):
    # Get the index of the book that matches the title
    idx = indices[title]

    # Get the pairwise similarity scores of all books with that book
    sim_scores = list(enumerate(cosine_sim[idx]))

    # Sort the books based on the similarity scores
    sim_scores = sorted(sim_scores, key=lambda x: x[1], reverse=True)

    # Get the scores of the 10 most similar books
    sim_scores = sim_scores[1:11]

    # Get the book indices
    book_indices = [i[0] for i in sim_scores]

    # Return the top 10 most similar books
    return merged_df['Book-Title'].iloc[book_indices]

# Example usage
print(recommend_books('Classical Mythology'))

KeyError: 'Book-Title'

In [ ]:
Next steps: 
#takeout books with rATING 0 
#Clustering model;; Silshoutte score